RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32f460_ll_interrupts_share.c
/**
 * @brief  Interrupt No.132 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ132_Handler(void)
{
    const uint32_t VSSEL132 = CM_INTC->VSSEL132;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    /* Timer6 Ch.3 A compare match */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMAF) && (0UL != (VSSEL132 & BIT_MASK_00))) {
            TMR6_3_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.3 B compare match */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMBF) && (0UL != (VSSEL132 & BIT_MASK_01))) {
            TMR6_3_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.3 C compare match */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMCF) && (0UL != (VSSEL132 & BIT_MASK_02))) {
            TMR6_3_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.3 D compare match */
    if (1UL == bCM_TMR6_3->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMDF) && (0UL != (VSSEL132 & BIT_MASK_03))) {
            TMR6_3_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.3 E compare match */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMEF) && (0UL != (VSSEL132 & BIT_MASK_04))) {
            TMR6_3_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.3 F compare match */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMFF) && (0UL != (VSSEL132 & BIT_MASK_05))) {
            TMR6_3_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.3 overflow */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_3->STFLR_b.OVFF) && (0UL != (VSSEL132 & BIT_MASK_06))) {
            TMR6_3_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.3 underflow */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_3->STFLR_b.UDFF) && (0UL != (VSSEL132 & BIT_MASK_07))) {
            TMR6_3_GUdf_IrqHandler();
        }
    }
    /* Timer6 Ch.3 dead time */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_3->STFLR_b.DTEF) && (0UL != (VSSEL132 & BIT_MASK_08))) {
            TMR6_3_GDte_IrqHandler();
        }
    }
    /* Timer6 Ch.3 A up-down compare match */
    u32Tmp1 = (CM_TMR6_3->ICONR & (BIT_MASK_16 | BIT_MASK_17)) >> 7U;
    u32Tmp2 = CM_TMR6_3->STFLR & (BIT_MASK_09 | BIT_MASK_10);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (0UL != (VSSEL132 & BIT_MASK_11)))) {
        TMR6_3_SCmpA_IrqHandler();
    }
    /* Timer6 Ch.3 B up-down compare match */
    u32Tmp1 = (CM_TMR6_3->ICONR & (BIT_MASK_18 | BIT_MASK_19)) >> 7U;
    u32Tmp2 = CM_TMR6_3->STFLR & (BIT_MASK_11 | BIT_MASK_12);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (0UL != (VSSEL132 & BIT_MASK_12)))) {
        TMR6_3_SCmpB_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.136 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ136_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    const uint32_t VSSEL136 = CM_INTC->VSSEL136;

    u32Tmp1 = CM_TMRA_1->BCSTR;
    /* TimerA Ch.1 overflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_12)) && (0UL != (u32Tmp1 & BIT_MASK_14)) && (0UL != (VSSEL136 & BIT_MASK_00))) {
        TMRA_1_Ovf_IrqHandler();
    }
    /* TimerA Ch.1 underflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_13)) && (0UL != (u32Tmp1 & BIT_MASK_15)) && (0UL != (VSSEL136 & BIT_MASK_01))) {
        TMRA_1_Udf_IrqHandler();
    }
    u32Tmp1 = CM_TMRA_1->ICONR;
    u32Tmp2 = CM_TMRA_1->STFLR;
    /* TimerA Ch.1 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0xFFUL)) && (0UL != (0xFFUL & VSSEL136))) {
        TMRA_1_Cmp_IrqHandler();
    }

    u32Tmp1 = CM_TMRA_2->BCSTR;
    /* TimerA Ch.2 overflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_12)) && (0UL != (u32Tmp1 & BIT_MASK_14)) && (0UL != (VSSEL136 & BIT_MASK_03))) {
        TMRA_2_Ovf_IrqHandler();
    }
    /* TimerA Ch.2 underflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_13)) && (0UL != (u32Tmp1 & BIT_MASK_15)) && (0UL != (VSSEL136 & BIT_MASK_04))) {
        TMRA_2_Udf_IrqHandler();
    }
    u32Tmp1 = CM_TMRA_2->ICONR;
    u32Tmp2 = CM_TMRA_2->STFLR;
    /* TimerA Ch.2 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0xFFUL)) && (0UL != (0xFFUL & VSSEL136))) {
        TMRA_2_Cmp_IrqHandler();
    }

    u32Tmp1 = CM_TMRA_3->BCSTR;
    /* TimerA Ch.3 overflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_12)) && (0UL != (u32Tmp1 & BIT_MASK_14)) && (0UL != (VSSEL136 & BIT_MASK_06))) {
        TMRA_3_Ovf_IrqHandler();
    }
    /* TimerA Ch.3 underflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_13)) && (0UL != (u32Tmp1 & BIT_MASK_15)) && (0UL != (VSSEL136 & BIT_MASK_07))) {
        TMRA_3_Udf_IrqHandler();
    }
    u32Tmp1 = CM_TMRA_3->ICONR;
    u32Tmp2 = CM_TMRA_3->STFLR;
    /* TimerA Ch.3 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0xFFUL)) && (0UL != (0xFFUL & VSSEL136))) {
        TMRA_3_Cmp_IrqHandler();
    }

    u32Tmp1 = CM_TMRA_4->BCSTR;
    /* TimerA Ch.4 overflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_12)) && (0UL != (u32Tmp1 & BIT_MASK_14)) && (0UL != (VSSEL136 & BIT_MASK_09))) {
        TMRA_4_Ovf_IrqHandler();
    }
    /* TimerA Ch.4 underflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_13)) && (0UL != (u32Tmp1 & BIT_MASK_15)) && (0UL != (VSSEL136 & BIT_MASK_10))) {
        TMRA_4_Udf_IrqHandler();
    }
    u32Tmp1 = CM_TMRA_4->ICONR;
    u32Tmp2 = CM_TMRA_4->STFLR;
    /* TimerA Ch.4 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0xFFUL)) && (0UL != (0xFFUL & VSSEL136))) {
        TMRA_4_Cmp_IrqHandler();
    }

    u32Tmp1 = CM_TMRA_5->BCSTR;
    /* TimerA Ch.5 overflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_12)) && (0UL != (u32Tmp1 & BIT_MASK_14)) && (0UL != (VSSEL136 & BIT_MASK_12))) {
        TMRA_5_Ovf_IrqHandler();
    }
    /* TimerA Ch.5 underflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_13)) && (0UL != (u32Tmp1 & BIT_MASK_15)) && (0UL != (VSSEL136 & BIT_MASK_13))) {
        TMRA_5_Udf_IrqHandler();
    }
    u32Tmp1 = CM_TMRA_5->ICONR;
    u32Tmp2 = CM_TMRA_5->STFLR;
    /* TimerA Ch.5 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0xFFUL)) && (0UL != (0xFFUL & VSSEL136))) {
        TMRA_5_Cmp_IrqHandler();
    }

    u32Tmp1 = CM_TMRA_6->BCSTR;
    /* TimerA Ch.6 overflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_12)) && (0UL != (u32Tmp1 & BIT_MASK_14)) && (0UL != (VSSEL136 & BIT_MASK_16))) {
        TMRA_6_Ovf_IrqHandler();
    }
    /* TimerA Ch.6 underflow */
    if ((0UL != (u32Tmp1 & BIT_MASK_13)) && (0UL != (u32Tmp1 & BIT_MASK_15)) && (0UL != (VSSEL136 & BIT_MASK_17))) {
        TMRA_6_Udf_IrqHandler();
    }
    u32Tmp1 = CM_TMRA_6->ICONR;
    u32Tmp2 = CM_TMRA_6->STFLR;
    /* TimerA Ch.6 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0xFFUL)) && (0UL != (0xFFUL & VSSEL136))) {
        TMRA_6_Cmp_IrqHandler();
    }
    /* USBFS global interrupt */
    if (1UL == bCM_USBFS->GAHBCFG_b.GINTMSK) {
        u32Tmp1 = CM_USBFS->GINTMSK & 0xF77CFCFBUL;
        u32Tmp2 = CM_USBFS->GINTSTS & 0xF77CFCFBUL;
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL136 & BIT_MASK_19))) {
            USBFS_Global_IrqHandler();
        }
    }

    u32Tmp1 = CM_USART1->SR;
    u32Tmp2 = CM_USART1->CR1;
    /* USART Ch.1 Receive error */
    if ((0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03))) &&   \
            (0UL != (VSSEL136 & BIT_MASK_22))) {
        USART1_RxError_IrqHandler();
    }
    /* USART Ch.1 Receive completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_05)) && (0UL != (BIT_MASK_05 & VSSEL136))) {
        USART1_RxFull_IrqHandler();
    }
    /* USART Ch.1 Transmit data empty */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_07)) && (0UL != (BIT_MASK_07 & VSSEL136))) {
        USART1_TxEmpty_IrqHandler();
    }
    /* USART Ch.1 Transmit completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_06)) && (0UL != (BIT_MASK_06 & VSSEL136))) {
        USART1_TxComplete_IrqHandler();
    }
    /* USART Ch.1 Receive timeout */
    if ((0UL != (u32Tmp2 & BIT_MASK_01)) && (0UL != (u32Tmp1 & BIT_MASK_08)) && (0UL != (VSSEL136 & BIT_MASK_26))) {
        USART1_RxTO_IrqHandler();
    }

