RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32f460_ll_interrupts_share.c
    u32Tmp1 = CM_USART2->SR;
    u32Tmp2 = CM_USART2->CR1;
    /* USART Ch.2 Receive error */
    if ((0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03))) &&   \
            (0UL != (VSSEL136 & BIT_MASK_27))) {
        USART2_RxError_IrqHandler();
    }
    /* USART Ch.2 Receive completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_05)) && (0UL != (BIT_MASK_05 & VSSEL136))) {
        USART2_RxFull_IrqHandler();
    }
    /* USART Ch.2 Transmit data empty */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_07)) && (0UL != (BIT_MASK_07 & VSSEL136))) {
        USART2_TxEmpty_IrqHandler();
    }
    /* USART Ch.2 Transmit completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_06)) && (0UL != (BIT_MASK_06 & VSSEL136))) {
        USART2_TxComplete_IrqHandler();
    }
    /* USART Ch.2 Receive timeout */
    if ((0UL != (u32Tmp2 & BIT_MASK_01)) && (0UL != (u32Tmp1 & BIT_MASK_08)) && (0UL != (VSSEL136 & BIT_MASK_31))) {
        USART2_RxTO_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.137 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ137_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    const uint32_t VSSEL137 = CM_INTC->VSSEL137;

    u32Tmp1 = CM_USART3->SR;
    u32Tmp2 = CM_USART3->CR1;
    /* USART Ch.3 Receive error */
    if ((0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03))) &&   \
            (0UL != (VSSEL137 & BIT_MASK_00))) {
        USART3_RxError_IrqHandler();
    }
    /* USART Ch.3 Receive completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_05)) && (0UL != (BIT_MASK_05 & VSSEL137))) {
        USART3_RxFull_IrqHandler();
    }
    /* USART Ch.3 Transmit data empty */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_07)) && (0UL != (BIT_MASK_07 & VSSEL137))) {
        USART3_TxEmpty_IrqHandler();
    }
    /* USART Ch.3 Transmit completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_06)) && (0UL != (BIT_MASK_06 & VSSEL137))) {
        USART3_TxComplete_IrqHandler();
    }
    /* USART Ch.3 Receive timeout */
    if ((0UL != (u32Tmp2 & BIT_MASK_01)) && (0UL != (u32Tmp1 & BIT_MASK_08)) && (0UL != (VSSEL137 & BIT_MASK_04))) {
        USART3_RxTO_IrqHandler();
    }

    u32Tmp1 = CM_USART4->SR;
    u32Tmp2 = CM_USART4->CR1;
    /* USART Ch.4 Receive error */
    if ((0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03))) &&   \
            (0UL != (VSSEL137 & BIT_MASK_05))) {
        USART4_RxError_IrqHandler();
    }
    /* USART Ch.4 Receive completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_05)) && (0UL != (BIT_MASK_05 & VSSEL137))) {
        USART4_RxFull_IrqHandler();
    }
    /* USART Ch.4 Transmit data empty */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_07)) && (0UL != (BIT_MASK_07 & VSSEL137))) {
        USART4_TxEmpty_IrqHandler();
    }
    /* USART Ch.4 Transmit completed */
    if ((0UL != (u32Tmp2 & u32Tmp1 & BIT_MASK_06)) && (0UL != (BIT_MASK_06 & VSSEL137))) {
        USART4_TxComplete_IrqHandler();
    }
    /* USART Ch.4 Receive timeout */
    if ((0UL != (u32Tmp2 & BIT_MASK_01)) && (0UL != (u32Tmp1 & BIT_MASK_08)) && (0UL != (VSSEL137 & BIT_MASK_09))) {
        USART4_RxTO_IrqHandler();
    }

    u32Tmp1 = CM_SPI1->CR1;
    u32Tmp2 = CM_SPI1->SR;
    /* SPI Ch.1 Receive completed */
    if ((0UL != (u32Tmp1 & BIT_MASK_10)) && (0UL != (u32Tmp2 & BIT_MASK_07)) && (0UL != (VSSEL137 & BIT_MASK_11))) {
        SPI1_RxFull_IrqHandler();
    }
    /* SPI Ch.1 Transmit buf empty */
    if ((0UL != (u32Tmp1 & BIT_MASK_09)) && (0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (VSSEL137 & BIT_MASK_12))) {
        SPI1_TxEmpty_IrqHandler();
    }
    /* SPI Ch.1 bus idle */
    if ((0UL != (u32Tmp1 & BIT_MASK_11)) && (0UL == (u32Tmp2 & BIT_MASK_01)) && (0UL != (VSSEL137 & BIT_MASK_13))) {
        SPI1_Idle_IrqHandler();
    }
    /* SPI Ch.1 parity/overflow/underflow/mode error */
    if ((0UL != (u32Tmp1 & BIT_MASK_08))                                                 &&  \
            (0UL != ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))))   &&  \
            (0UL != (VSSEL137 & BIT_MASK_14))) {
        SPI1_Error_IrqHandler();
    }

    u32Tmp1 = CM_SPI2->CR1;
    u32Tmp2 = CM_SPI2->SR;
    /* SPI Ch.2 Receive completed */
    if ((0UL != (u32Tmp1 & BIT_MASK_10)) && (0UL != (u32Tmp2 & BIT_MASK_07)) && (0UL != (VSSEL137 & BIT_MASK_16))) {
        SPI2_RxFull_IrqHandler();
    }
    /* SPI Ch.2 Transmit buf empty */
    if ((0UL != (u32Tmp1 & BIT_MASK_09)) && (0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (VSSEL137 & BIT_MASK_17))) {
        SPI2_TxEmpty_IrqHandler();
    }
    /* SPI Ch.2 bus idle */
    if ((0UL != (u32Tmp1 & BIT_MASK_11)) && (0UL == (u32Tmp2 & BIT_MASK_01)) && (0UL != (VSSEL137 & BIT_MASK_18))) {
        SPI2_Idle_IrqHandler();
    }
    /* SPI Ch.2 parity/overflow/underflow/mode error */
    if ((0UL != (u32Tmp1 & BIT_MASK_08))                                                 &&  \
            (0UL != ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))))   &&  \
            (0UL != (VSSEL137 & BIT_MASK_19))) {
        SPI2_Error_IrqHandler();
    }

    u32Tmp1 = CM_SPI3->CR1;
    u32Tmp2 = CM_SPI3->SR;
    /* SPI Ch.3 Receive completed */
    if ((0UL != (u32Tmp1 & BIT_MASK_10)) && (0UL != (u32Tmp2 & BIT_MASK_07)) && (0UL != (VSSEL137 & BIT_MASK_21))) {
        SPI3_RxFull_IrqHandler();
    }
    /* SPI Ch.3 Transmit buf empty */
    if ((0UL != (u32Tmp1 & BIT_MASK_09)) && (0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (VSSEL137 & BIT_MASK_22))) {
        SPI3_TxEmpty_IrqHandler();
    }
    /* SPI Ch.3 bus idle */
    if ((0UL != (u32Tmp1 & BIT_MASK_11)) && (0UL == (u32Tmp2 & BIT_MASK_01)) && (0UL != (VSSEL137 & BIT_MASK_23))) {
        SPI3_Idle_IrqHandler();
    }
    /* SPI Ch.3 parity/overflow/underflow/mode error */
    if ((0UL != (u32Tmp1 & BIT_MASK_08))                                                 &&  \
            (0UL != ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))))   &&  \
            (0UL != (VSSEL137 & BIT_MASK_24))) {
        SPI3_Error_IrqHandler();
    }

    u32Tmp1 = CM_SPI4->CR1;
    u32Tmp2 = CM_SPI4->SR;
    /* SPI Ch.4 Receive completed */
    if ((0UL != (u32Tmp1 & BIT_MASK_10)) && (0UL != (u32Tmp2 & BIT_MASK_07)) && (0UL != (VSSEL137 & BIT_MASK_26))) {
        SPI4_RxFull_IrqHandler();
    }
    /* SPI Ch.4 Transmit buf empty */
    if ((0UL != (u32Tmp1 & BIT_MASK_09)) && (0UL != (u32Tmp2 & BIT_MASK_05)) && (0UL != (VSSEL137 & BIT_MASK_27))) {
        SPI4_TxEmpty_IrqHandler();
    }
    /* SPI Ch.4 bus idle */
    if ((0UL != (u32Tmp1 & BIT_MASK_11)) && (0UL == (u32Tmp2 & BIT_MASK_01)) && (0UL != (VSSEL137 & BIT_MASK_28))) {
        SPI4_Idle_IrqHandler();
    }
    /* SPI Ch.4 parity/overflow/underflow/mode error */
    if ((0UL != (u32Tmp1 & BIT_MASK_08))                                                 &&  \
            (0UL != ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))))   &&  \
            (0UL != (VSSEL137 & BIT_MASK_29))) {
        SPI4_Error_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.138 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ138_Handler(void)
{
    const uint32_t VSSEL138 = CM_INTC->VSSEL138;
    uint32_t u32Tmp1;

    u32Tmp1 = CM_TMR4_1->OCSRU;
    /* Timer4 Ch.1 U phase higher compare match */
    if ((0UL != (VSSEL138 & BIT_MASK_00)) && (0UL != (u32Tmp1 & BIT_MASK_04)) && (0UL != (u32Tmp1 & BIT_MASK_06))) {
        TMR4_1_GCmpUH_IrqHandler();
    }
    /* Timer4 Ch.1 U phase lower compare match */
    if ((0UL != (VSSEL138 & BIT_MASK_01)) && (0UL != (u32Tmp1 & BIT_MASK_05)) && (0UL != (u32Tmp1 & BIT_MASK_07))) {
        TMR4_1_GCmpUL_IrqHandler();
    }

    u32Tmp1 = CM_TMR4_1->OCSRV;
    /* Timer4 Ch.1 V phase higher compare match */
    if ((0UL != (VSSEL138 & BIT_MASK_02)) && (0UL != (u32Tmp1 & BIT_MASK_04)) && (0UL != (u32Tmp1 & BIT_MASK_06))) {
        TMR4_1_GCmpVH_IrqHandler();
    }
    /* Timer4 Ch.1 V phase lower compare match */
    if ((0UL != (VSSEL138 & BIT_MASK_03)) && (0UL != (u32Tmp1 & BIT_MASK_05)) && (0UL != (u32Tmp1 & BIT_MASK_07))) {
        TMR4_1_GCmpVL_IrqHandler();
    }

    u32Tmp1 = CM_TMR4_1->OCSRW;
    /* Timer4 Ch.1 W phase higher compare match */
    if ((0UL != (VSSEL138 & BIT_MASK_04)) && (0UL != (u32Tmp1 & BIT_MASK_04)) && (0UL != (u32Tmp1 & BIT_MASK_06))) {
        TMR4_1_GCmpWH_IrqHandler();
    }
    /* Timer4 Ch.1 W phase lower compare match */
    if ((0UL != (VSSEL138 & BIT_MASK_05)) && (0UL != (u32Tmp1 & BIT_MASK_05)) && (0UL != (u32Tmp1 & BIT_MASK_07))) {
        TMR4_1_GCmpWL_IrqHandler();
    }

    u32Tmp1 = CM_TMR4_1->CCSR;
    /* Timer4 Ch.1 overflow */
    if ((0UL != (VSSEL138 & BIT_MASK_06)) && (0UL != (u32Tmp1 & BIT_MASK_08)) && (0UL != (u32Tmp1 & BIT_MASK_09))) {
        TMR4_1_GOvf_IrqHandler();
    }
    /* Timer4 Ch.1 underflow */
    if ((0UL != (VSSEL138 & BIT_MASK_07)) && (0UL != (u32Tmp1 & BIT_MASK_13)) && (0UL != (u32Tmp1 & BIT_MASK_14))) {
        TMR4_1_GUdf_IrqHandler();
    }

    u32Tmp1 = CM_TMR4_1->RCSR;
    /* Timer4 Ch.1 U phase reload */
    if ((0UL != (VSSEL138 & BIT_MASK_08)) && (0UL == (u32Tmp1 & BIT_MASK_00)) && (0UL != (u32Tmp1 & BIT_MASK_04))) {
        TMR4_1_ReloadU_IrqHandler();
    }
    /* Timer4 Ch.1 V phase reload */
    if ((0UL != (VSSEL138 & BIT_MASK_09)) && (0UL == (u32Tmp1 & BIT_MASK_01)) && (0UL != (u32Tmp1 & BIT_MASK_08))) {
        TMR4_1_ReloadV_IrqHandler();
    }
    /* Timer4 Ch.1 W phase reload */
    if ((0UL != (VSSEL138 & BIT_MASK_10)) && (0UL == (u32Tmp1 & BIT_MASK_02)) && (0UL != (u32Tmp1 & BIT_MASK_12))) {
        TMR4_1_ReloadW_IrqHandler();
    }

