RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32f460_ll_interrupts_share.c
    /* WDT */
    if ((0UL != (CM_WDT->SR & (BIT_MASK_16 | BIT_MASK_17))) && (0UL != (VSSEL141 & BIT_MASK_23))) {
        WDT_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.142 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ142_Handler(void)
{
    uint32_t u32VSSEL142 = CM_INTC->VSSEL142;
    /* ADC unit.1 seq. A */
    if (1UL == bCM_ADC1->ICR_b.EOCAIEN) {
        if ((1UL == bCM_ADC1->ISR_b.EOCAF) && (0UL != (u32VSSEL142 & BIT_MASK_00))) {
            ADC1_SeqA_IrqHandler();
        }
    }
    /* ADC unit.1 seq. B */
    if (1UL == bCM_ADC1->ICR_b.EOCBIEN) {
        if ((1UL == bCM_ADC1->ISR_b.EOCBF) && (0UL != (u32VSSEL142 & BIT_MASK_01))) {
            ADC1_SeqB_IrqHandler();
        }
    }
    /* ADC unit.1 ADW channel compare */
    if (1UL == bCM_ADC1->AWDCR_b.AWDIEN) {
        if ((0UL != (CM_ADC1->AWDSR & 0x1FFFFU)) && (0UL != (u32VSSEL142 & BIT_MASK_02))) {
            ADC1_ChCmp_IrqHandler();
        }
    }
    /* ADC unit.1 AWD Seq. compare */
    if (1UL == bCM_ADC1->AWDCR_b.AWDIEN) {
        if ((0UL != (CM_ADC1->AWDSR & 0x1FFFFU)) && (0UL != (u32VSSEL142 & BIT_MASK_03))) {
            ADC1_SeqCmp_IrqHandler();
        }
    }

    /* ADC unit.2 seq. A */
    if (1UL == bCM_ADC2->ICR_b.EOCAIEN) {
        if ((1UL == bCM_ADC2->ISR_b.EOCAF) && (0UL != (u32VSSEL142 & BIT_MASK_04))) {
            ADC2_SeqA_IrqHandler();
        }
    }
    /* ADC unit.2 seq. B */
    if (1UL == bCM_ADC2->ICR_b.EOCBIEN) {
        if ((1UL == bCM_ADC2->ISR_b.EOCBF) && (0UL != (u32VSSEL142 & BIT_MASK_05))) {
            ADC2_SeqB_IrqHandler();
        }
    }
    /* ADC unit.2 ADW channel compare */
    if (1UL == bCM_ADC2->AWDCR_b.AWDIEN) {
        if ((0UL != (CM_ADC2->AWDSR & 0x1FFU)) && (0UL != (u32VSSEL142 & BIT_MASK_06))) {
            ADC2_ChCmp_IrqHandler();
        }
    }
    /* ADC unit.2 AWD Seq. compare */
    if (1UL == bCM_ADC2->AWDCR_b.AWDIEN) {
        if ((0UL != (CM_ADC2->AWDSR & 0x1FFU)) && (0UL != (u32VSSEL142 & BIT_MASK_07))) {
            ADC2_SeqCmp_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.143 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ143_Handler(void)
{
    uint8_t RTIF;
    uint8_t RTIE;
    uint8_t ERRINT;
    uint8_t TTCFG;
    uint16_t NORINTST;
    uint16_t NORINTSGEN;
    uint16_t ERRINTST;
    uint16_t ERRINTSGEN;

    /* SDIO Ch.1 */
    if (1UL == bCM_INTC->VSSEL143_b.VSEL2) {
        NORINTST = CM_SDIOC1->NORINTST;
        NORINTSGEN = CM_SDIOC1->NORINTSGEN;
        ERRINTST = CM_SDIOC1->ERRINTST;
        ERRINTSGEN = CM_SDIOC1->ERRINTSGEN;

        if ((0U != (NORINTST & NORINTSGEN & 0x01F7U)) || (0U != (ERRINTST & ERRINTSGEN & 0x017FU))) {
            SDIOC1_IrqHandler();
        }
    }

    /* SDIO Ch.2 */
    if (1UL == bCM_INTC->VSSEL143_b.VSEL5) {
        NORINTST = CM_SDIOC2->NORINTST;
        NORINTSGEN = CM_SDIOC2->NORINTSGEN;
        ERRINTST = CM_SDIOC2->ERRINTST;
        ERRINTSGEN = CM_SDIOC2->ERRINTSGEN;

        if ((0U != (NORINTST & NORINTSGEN & 0x01F7U)) || (0U != (ERRINTST & ERRINTSGEN & 0x017FU))) {
            SDIOC2_IrqHandler();
        }
    }

    /* CAN */
    if (1UL == bCM_INTC->VSSEL143_b.VSEL6) {
        RTIF = CM_CAN->RTIF;
        RTIE = CM_CAN->RTIE;
        ERRINT = CM_CAN->ERRINT;
        TTCFG = CM_CAN->TTCFG;
        if (((0U != (TTCFG & BIT_MASK_05))                                          ||  \
                (0U != (RTIF & BIT_MASK_00))                                           ||  \
                (0U != (RTIF & RTIE & 0xFEU))                                          ||  \
                ((0U != (ERRINT & BIT_MASK_00)) && (0U != (ERRINT & BIT_MASK_01)))     ||  \
                ((0U != (ERRINT & BIT_MASK_02)) && (0U != (ERRINT & BIT_MASK_03)))     ||  \
                ((0U != (ERRINT & BIT_MASK_04)) && (0U != (ERRINT & BIT_MASK_05)))     ||  \
                ((0U != (TTCFG & BIT_MASK_03)) && (0U != (TTCFG  & BIT_MASK_04)))     ||  \
                ((0U != (TTCFG & BIT_MASK_06)) && (0U != (TTCFG & BIT_MASK_07)))) != 0U) {
            CAN_IrqHandler();
        }
    }
}
/**
 * @}
 */

/**
 * @defgroup Share_Interrupts_Weakdef_Prototypes Share Interrupts weak function prototypes
 * @{
 */
__WEAKDEF void EXTINT00_IrqHandler(void)
{
}
__WEAKDEF void EXTINT01_IrqHandler(void)
{
}
__WEAKDEF void EXTINT02_IrqHandler(void)
{
}
__WEAKDEF void EXTINT03_IrqHandler(void)
{
}
__WEAKDEF void EXTINT04_IrqHandler(void)
{
}
__WEAKDEF void EXTINT05_IrqHandler(void)
{
}
__WEAKDEF void EXTINT06_IrqHandler(void)
{
}
__WEAKDEF void EXTINT07_IrqHandler(void)
{
}
__WEAKDEF void EXTINT08_IrqHandler(void)
{
}
__WEAKDEF void EXTINT09_IrqHandler(void)
{
}
__WEAKDEF void EXTINT10_IrqHandler(void)
{
}
__WEAKDEF void EXTINT11_IrqHandler(void)
{
}
__WEAKDEF void EXTINT12_IrqHandler(void)
{
}
__WEAKDEF void EXTINT13_IrqHandler(void)
{
}
__WEAKDEF void EXTINT14_IrqHandler(void)
{
}
__WEAKDEF void EXTINT15_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC0_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC1_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC2_IrqHandler(void)
{
}
__WEAKDEF void DMA1_TC3_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC0_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC1_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC2_IrqHandler(void)
{
}
__WEAKDEF void DMA2_TC3_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC0_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC1_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC2_IrqHandler(void)
{
}
__WEAKDEF void DMA1_BTC3_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC0_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC1_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC2_IrqHandler(void)
{
}
__WEAKDEF void DMA2_BTC3_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error0_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error1_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error2_IrqHandler(void)
{
}
__WEAKDEF void DMA1_Error3_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error0_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error1_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error2_IrqHandler(void)
{
}
__WEAKDEF void DMA2_Error3_IrqHandler(void)
{
}
__WEAKDEF void EFM_ProgramEraseError_IrqHandler(void)
{
}
__WEAKDEF void EFM_ColError_IrqHandler(void)
{
}
__WEAKDEF void EFM_OpEnd_IrqHandler(void)
{
}
__WEAKDEF void QSPI_Error_IrqHandler(void)
{
}
__WEAKDEF void DCU1_IrqHandler(void)
{
}
__WEAKDEF void DCU2_IrqHandler(void)
{
}
__WEAKDEF void DCU3_IrqHandler(void)
{
}
__WEAKDEF void DCU4_IrqHandler(void)
{
}
__WEAKDEF void TMR0_1_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR0_1_CmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR0_2_CmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR0_2_CmpB_IrqHandler(void)
{
}
__WEAKDEF void CLK_XtalStop_IrqHandler(void)
{
}
__WEAKDEF void PWC_WakeupTimer_IrqHandler(void)
{
}
__WEAKDEF void SWDT_IrqHandler(void)
{
}
__WEAKDEF void WDT_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_GDte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_SCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_1_SCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_GDte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_SCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_2_SCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpC_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpD_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpE_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GCmpF_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_GDte_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_SCmpA_IrqHandler(void)
{
}
__WEAKDEF void TMR6_3_SCmpB_IrqHandler(void)
{
}
__WEAKDEF void TMRA_1_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_1_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_1_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_2_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_2_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_2_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_3_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_3_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_3_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_4_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_4_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_4_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_5_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_5_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_5_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRA_6_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_6_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_6_Cmp_IrqHandler(void)
{
}
__WEAKDEF void USBFS_Global_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART1_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART1_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxTO_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART2_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART2_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxTO_IrqHandler(void)
{
}
__WEAKDEF void USART3_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART3_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART3_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART3_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART3_RxTO_IrqHandler(void)
{
}
__WEAKDEF void USART4_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART4_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART4_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART4_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART4_RxTO_IrqHandler(void)
{
}
__WEAKDEF void SPI1_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI1_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI1_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI1_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI2_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI2_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI2_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI2_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI3_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI3_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI3_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI3_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI4_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI4_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI4_Error_IrqHandler(void)
{
}
__WEAKDEF void SPI4_Idle_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpUH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpUL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpVH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpVL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpWH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GCmpWL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_ReloadU_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_ReloadV_IrqHandler(void)
{
}
__WEAKDEF void TMR4_1_ReloadW_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpUH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpUL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpVH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpVL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpWH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GCmpWL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_ReloadU_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_ReloadV_IrqHandler(void)
{
}
__WEAKDEF void TMR4_2_ReloadW_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpUH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpUL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpVH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpVL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpWH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GCmpWL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GOvf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_GUdf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_ReloadU_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_ReloadV_IrqHandler(void)
{
}
__WEAKDEF void TMR4_3_ReloadW_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR0_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR1_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR2_IrqHandler(void)
{
}
__WEAKDEF void EMB_GR3_IrqHandler(void)
{
}
__WEAKDEF void I2S1_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S1_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S1_Error_IrqHandler(void)
{
}
__WEAKDEF void I2S2_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S2_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S2_Error_IrqHandler(void)
{
}
__WEAKDEF void I2S3_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S3_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S3_Error_IrqHandler(void)
{
}
__WEAKDEF void I2S4_Tx_IrqHandler(void)
{
}
__WEAKDEF void I2S4_Rx_IrqHandler(void)
{
}
__WEAKDEF void I2S4_Error_IrqHandler(void)
{
}
__WEAKDEF void I2C1_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C1_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C1_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C1_Error_IrqHandler(void)
{
}
__WEAKDEF void I2C2_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C2_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C2_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C2_Error_IrqHandler(void)
{
}
__WEAKDEF void I2C3_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C3_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C3_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C3_Error_IrqHandler(void)
{
}
__WEAKDEF void PWC_LVD1_IrqHandler(void)
{
}
__WEAKDEF void PWC_LVD2_IrqHandler(void)
{
}
__WEAKDEF void FCM_Error_IrqHandler(void)
{
}
__WEAKDEF void FCM_End_IrqHandler(void)
{
}
__WEAKDEF void FCM_Ovf_IrqHandler(void)
{
}
__WEAKDEF void ADC1_SeqA_IrqHandler(void)
{
}
__WEAKDEF void ADC1_SeqB_IrqHandler(void)
{
}
__WEAKDEF void ADC1_ChCmp_IrqHandler(void)
{
}
__WEAKDEF void ADC1_SeqCmp_IrqHandler(void)
{
}
__WEAKDEF void ADC2_SeqA_IrqHandler(void)
{
}
__WEAKDEF void ADC2_SeqB_IrqHandler(void)
{
}
__WEAKDEF void ADC2_ChCmp_IrqHandler(void)
{
}
__WEAKDEF void ADC2_SeqCmp_IrqHandler(void)
{
}
__WEAKDEF void SDIOC1_IrqHandler(void)
{
}
__WEAKDEF void SDIOC2_IrqHandler(void)
{
}
__WEAKDEF void CAN_IrqHandler(void)
{
}
/**
 * @}
 */

#endif /* LL_INTERRUPTS_SHARE_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
